dataset_gen/NS_datasets/FPO_external/Irregular/Design_Point_0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            patch;
        nFaces          128;
        startFace       31968;
    }
    right
    {
        type            patch;
        nFaces          128;
        startFace       32096;
    }
    bottom
    {
        type            patch;
        nFaces          128;
        startFace       32224;
    }
    top
    {
        type            patch;
        nFaces          128;
        startFace       32352;
    }
    hole
    {
        type            wall;
        inGroups        1(wall);
        nFaces          64;
        startFace       32480;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32256;
        startFace       32544;
    }
)

// ************************************************************************* //
